In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import gspread

old fashion csv import for now

In [5]:
# pull in data from gsheets

tipout_df = pd.read_csv('../Untitled Folder/Monthly Front Desk Tipout - Sheet1.csv')

In [6]:
tipout_df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Name:,Cassi,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Year:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,January,February,March,April,May,June,July,August,September,October,November,December,Daily Tip Average
5,Date:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,1,77,0,0,151,31,0,119,0,0,214,0,NaN,118.4
7,2,71,0,0,66,0,0,141,0,153,78,0,NaN,101.8
8,3,0,0,0,13,0,139,130,0,139,0,0,NaN,105.25
9,4,0,67,117,0,0,110,0,0,105,0,73,NaN,94.4

In [9]:
set(tipout_df)

{'Unnamed: 0',
 'Unnamed: 1',
 'Unnamed: 10',
 'Unnamed: 11',
 'Unnamed: 12',
 'Unnamed: 13',
 'Unnamed: 2',
 'Unnamed: 3',
 'Unnamed: 4',
 'Unnamed: 5',
 'Unnamed: 6',
 'Unnamed: 7',
 'Unnamed: 8',
 'Unnamed: 9'}

In [243]:
# make a copy of the original so it can be transformed

yearly_df = tipout_df.copy()

In [244]:
# need to rename columns with date, and corresponding months

yearly_df.rename(columns = 
        {'Unnamed: 0': 'date',
         'Unnamed: 1': 'january',
         'Unnamed: 2': 'february',
         'Unnamed: 3': 'march',
         'Unnamed: 4': 'april',
         'Unnamed: 5': 'may',
         'Unnamed: 6': 'june',
         'Unnamed: 7': 'july',
         'Unnamed: 8': 'august',
         'Unnamed: 9': 'september',
         'Unnamed: 10': 'october',
         'Unnamed: 11': 'november',
         'Unnamed: 12': 'december'}, inplace=True
)

In [245]:
# Unnamed: 13 will be dropped later

yearly_df.columns

Index([u'date', u'january', u'february', u'march', u'april', u'may', u'june',
       u'july', u'august', u'september', u'october', u'november', u'december',
       u'Unnamed: 13'],
      dtype='object')

In [246]:
yearly_df.head(7)

,date,january,february,march,april,may,june,july,august,september,october,november,december,Unnamed: 13
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Name:,Cassi,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Year:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,January,February,March,April,May,June,July,August,September,October,November,December,Daily Tip Average
5,Date:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,1,77,0,0,151,31,0,119,0,0,214,0,NaN,118.4

In [247]:
# can get rid of these rows now that columns have been renamed

yearly_df.drop(yearly_df.index[:6], inplace=True)

In [248]:
yearly_df.head(3)

,date,january,february,march,april,may,june,july,august,september,october,november,december,Unnamed: 13
6,1,77,0,0,151,31,0,119,0,0,214,0,NaN,118.4
7,2,71,0,0,66,0,0,141,0,153,78,0,NaN,101.8
8,3,0,0,0,13,0,139,130,0,139,0,0,NaN,105.25

In [249]:
yearly_df.reset_index(drop=True, inplace=True)

In [250]:
yearly_df.head()

,date,january,february,march,april,may,june,july,august,september,october,november,december,Unnamed: 13
0,1,77,0,0,151,31,0,119,0,0,214,0,NaN,118.4
1,2,71,0,0,66,0,0,141,0,153,78,0,NaN,101.8
2,3,0,0,0,13,0,139,130,0,139,0,0,NaN,105.25
3,4,0,67,117,0,0,110,0,0,105,0,73,NaN,94.4
4,5,0,68,74,0,0,55,0,117,0,0,128,NaN,88.4

In [251]:
len(yearly_df)

44

In [252]:
# need to drop last 13 rows off the tail (index 37-49)

yearly_df.drop(yearly_df.index[-13:], inplace=True)

In [253]:
yearly_df.tail()

,date,january,february,march,april,may,june,july,august,september,october,november,december,Unnamed: 13
26,27,0,50,47,0,133,0,0,89,0,0,31,NaN,70
27,28,96,0,0,0,71,0,0,81,0,101,0,NaN,87.25
28,29,91,0,0,162,45,0,68,0,0,96,0,NaN,92.4
29,30,39,0,0,85,0,0,120,0,249,108,0,NaN,120.2
30,31,0,0,0,0,0,0,25,0,0,0,0,NaN,25

In [254]:
# looks like all unwanted rows have been deleted

len(yearly_df)

31

In [255]:
# get rid of unwanted column

yearly_df.drop('Unnamed: 13', axis=1, inplace=True)

In [256]:
yearly_df.columns

Index([u'date', u'january', u'february', u'march', u'april', u'may', u'june',
       u'july', u'august', u'september', u'october', u'november', u'december'],
      dtype='object')

In [257]:
yearly_df.dtypes

date         object
january      object
february     object
march        object
april        object
may          object
june         object
july         object
august       object
september    object
october      object
november     object
december     object
dtype: object

In [258]:
# need to fill december NaN before casting series to floats

yearly_df.december.fillna(0, inplace=True)

In [262]:
# need to cast month values as integers

yearly_df = yearly_df.astype(float)

In [263]:
yearly_df.dtypes

date         float64
january      float64
february     float64
march        float64
april        float64
may          float64
june         float64
july         float64
august       float64
september    float64
october      float64
november     float64
december     float64
dtype: object

In [267]:
# need to replace 0 with NaN's

yearly_df = yearly_df.replace(0, np.NaN)

In [268]:
yearly_df.head()

,date,january,february,march,april,may,june,july,august,september,october,november,december
0,1.0,77.0,NaN,NaN,151.0,31.0,NaN,119.0,NaN,NaN,214.0,NaN,NaN
1,2.0,71.0,NaN,NaN,66.0,NaN,NaN,141.0,NaN,153.0,78.0,NaN,NaN
2,3.0,NaN,NaN,NaN,13.0,NaN,139.0,130.0,NaN,139.0,NaN,NaN,NaN
3,4.0,NaN,67.0,117.0,NaN,NaN,110.0,NaN,NaN,105.0,NaN,73.0,NaN
4,5.0,NaN,68.0,74.0,NaN,NaN,55.0,NaN,117.0,NaN,NaN,128.0,NaN

In [289]:
# pickle it now that transformations are done

yearly_df.to_pickle('pickles/yearly_tipout')

In [269]:
yearly_df.january.mean()

80.57142857142857

In [291]:
yearly_df.describe()

,date,january,february,march,april,may,june,july,august,september,october,november,december
count,31.000000,14.000000,12.000000,12.000000,14.000000,13.000000,12.000000,15.000000,12.000000,13.000000,14.000000,12.000000,0.0
mean,16.000000,80.571429,82.500000,106.916667,91.285714,76.153846,105.166667,109.733333,100.333333,141.307692,131.000000,76.583333,NaN
std,9.092121,37.997397,26.868366,46.576347,49.281653,36.669347,44.927888,46.220692,46.624873,48.631925,44.343068,44.011276,NaN
min,1.000000,21.000000,50.000000,47.000000,13.000000,22.000000,39.000000,25.000000,13.000000,61.000000,78.000000,23.000000,NaN
25%,8.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,16.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,23.500000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,31.000000,153.000000,132.000000,193.000000,162.000000,133.000000,192.000000,216.000000,181.000000,249.000000,221.000000,162.000000,NaN

In [272]:
((yearly_df.january.mean() + 50) / 10)

13.057142857142855

In [285]:
cols = yearly_df.columns
    
def get_hourly_rate(df, wage, hours):
    for col in cols:
        hourly_rate = ((df.col.mean() + wage) / hours)
    return hourly_rate

In [287]:
# get_hourly_rate(yearly_df, 50, 10)